frankleonrose/framework-cmsis-atmelsam/variants/atmelsam/sam4l8/include/component/bscif.h
/* -------- BSCIF_IMR : (BSCIF Offset: 0x008) (R/  32) Interrupt Mask Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t OSC32RDY:1;       /*!< bit:      0  32kHz Oscillator Ready             */
    uint32_t RC32KRDY:1;       /*!< bit:      1  32kHz RC Oscillator Ready          */
    uint32_t RC32KLOCK:1;      /*!< bit:      2  32kHz RC Oscillator Lock           */
    uint32_t RC32KREFE:1;      /*!< bit:      3  32kHz RC Oscillator Reference Error */
    uint32_t RC32KSAT:1;       /*!< bit:      4  32kHz RC Oscillator Saturation     */
    uint32_t BOD33DET:1;       /*!< bit:      5  BOD33 Detected                     */
    uint32_t BOD18DET:1;       /*!< bit:      6  BOD18 Detected                     */
    uint32_t BOD33SYNRDY:1;    /*!< bit:      7  BOD33 Synchronization Ready        */
    uint32_t BOD18SYNRDY:1;    /*!< bit:      8  BOD18 Synchronization Ready        */
    uint32_t SSWRDY:1;         /*!< bit:      9  VREG Stop Switching Ready          */
    uint32_t VREGOK:1;         /*!< bit:     10  Main VREG OK                       */
    uint32_t :1;               /*!< bit:     11  Reserved                           */
    uint32_t LPBGRDY:1;        /*!< bit:     12  Low Power Bandgap Voltage Reference Ready */
    uint32_t :18;              /*!< bit: 13..30  Reserved                           */
    uint32_t AE:1;             /*!< bit:     31  Access Error                       */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} BSCIF_IMR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define BSCIF_IMR_OFFSET            0x008        /**< \brief (BSCIF_IMR offset) Interrupt Mask Register */
#define BSCIF_IMR_RESETVALUE        _U(0x00000000); /**< \brief (BSCIF_IMR reset_value) Interrupt Mask Register */

#define BSCIF_IMR_OSC32RDY_Pos      0            /**< \brief (BSCIF_IMR) 32kHz Oscillator Ready */
#define BSCIF_IMR_OSC32RDY          (_U(0x1) << BSCIF_IMR_OSC32RDY_Pos)
#define BSCIF_IMR_RC32KRDY_Pos      1            /**< \brief (BSCIF_IMR) 32kHz RC Oscillator Ready */
#define BSCIF_IMR_RC32KRDY          (_U(0x1) << BSCIF_IMR_RC32KRDY_Pos)
#define BSCIF_IMR_RC32KLOCK_Pos     2            /**< \brief (BSCIF_IMR) 32kHz RC Oscillator Lock */
#define BSCIF_IMR_RC32KLOCK         (_U(0x1) << BSCIF_IMR_RC32KLOCK_Pos)
#define BSCIF_IMR_RC32KREFE_Pos     3            /**< \brief (BSCIF_IMR) 32kHz RC Oscillator Reference Error */
#define BSCIF_IMR_RC32KREFE         (_U(0x1) << BSCIF_IMR_RC32KREFE_Pos)
#define BSCIF_IMR_RC32KSAT_Pos      4            /**< \brief (BSCIF_IMR) 32kHz RC Oscillator Saturation */
#define BSCIF_IMR_RC32KSAT          (_U(0x1) << BSCIF_IMR_RC32KSAT_Pos)
#define BSCIF_IMR_BOD33DET_Pos      5            /**< \brief (BSCIF_IMR) BOD33 Detected */
#define BSCIF_IMR_BOD33DET          (_U(0x1) << BSCIF_IMR_BOD33DET_Pos)
#define BSCIF_IMR_BOD18DET_Pos      6            /**< \brief (BSCIF_IMR) BOD18 Detected */
#define BSCIF_IMR_BOD18DET          (_U(0x1) << BSCIF_IMR_BOD18DET_Pos)
#define BSCIF_IMR_BOD33SYNRDY_Pos   7            /**< \brief (BSCIF_IMR) BOD33 Synchronization Ready */
#define BSCIF_IMR_BOD33SYNRDY       (_U(0x1) << BSCIF_IMR_BOD33SYNRDY_Pos)
#define BSCIF_IMR_BOD18SYNRDY_Pos   8            /**< \brief (BSCIF_IMR) BOD18 Synchronization Ready */
#define BSCIF_IMR_BOD18SYNRDY       (_U(0x1) << BSCIF_IMR_BOD18SYNRDY_Pos)
#define BSCIF_IMR_SSWRDY_Pos        9            /**< \brief (BSCIF_IMR) VREG Stop Switching Ready */
#define BSCIF_IMR_SSWRDY            (_U(0x1) << BSCIF_IMR_SSWRDY_Pos)
#define BSCIF_IMR_VREGOK_Pos        10           /**< \brief (BSCIF_IMR) Main VREG OK */
#define BSCIF_IMR_VREGOK            (_U(0x1) << BSCIF_IMR_VREGOK_Pos)
#define BSCIF_IMR_LPBGRDY_Pos       12           /**< \brief (BSCIF_IMR) Low Power Bandgap Voltage Reference Ready */
#define BSCIF_IMR_LPBGRDY           (_U(0x1) << BSCIF_IMR_LPBGRDY_Pos)
#define BSCIF_IMR_AE_Pos            31           /**< \brief (BSCIF_IMR) Access Error */
#define BSCIF_IMR_AE                (_U(0x1) << BSCIF_IMR_AE_Pos)
#define BSCIF_IMR_MASK              _U(0x800017FF) /**< \brief (BSCIF_IMR) MASK Register */

/* -------- BSCIF_ISR : (BSCIF Offset: 0x00C) (R/  32) Interrupt Status Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t OSC32RDY:1;       /*!< bit:      0  32kHz Oscillator Ready             */
    uint32_t RC32KRDY:1;       /*!< bit:      1  32kHz RC Oscillator Ready          */
    uint32_t RC32KLOCK:1;      /*!< bit:      2  32kHz RC Oscillator Lock           */
    uint32_t RC32KREFE:1;      /*!< bit:      3  32kHz RC Oscillator Reference Error */
    uint32_t RC32KSAT:1;       /*!< bit:      4  32kHz RC Oscillator Saturation     */
    uint32_t BOD33DET:1;       /*!< bit:      5  BOD33 Detected                     */
    uint32_t BOD18DET:1;       /*!< bit:      6  BOD18 Detected                     */
    uint32_t BOD33SYNRDY:1;    /*!< bit:      7  BOD33 Synchronization Ready        */
    uint32_t BOD18SYNRDY:1;    /*!< bit:      8  BOD18 Synchronization Ready        */
    uint32_t SSWRDY:1;         /*!< bit:      9  VREG Stop Switching Ready          */
    uint32_t VREGOK:1;         /*!< bit:     10  Main VREG OK                       */
    uint32_t :1;               /*!< bit:     11  Reserved                           */
    uint32_t LPBGRDY:1;        /*!< bit:     12  Low Power Bandgap Voltage Reference Ready */
    uint32_t :18;              /*!< bit: 13..30  Reserved                           */
    uint32_t AE:1;             /*!< bit:     31  Access Error                       */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} BSCIF_ISR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define BSCIF_ISR_OFFSET            0x00C        /**< \brief (BSCIF_ISR offset) Interrupt Status Register */
#define BSCIF_ISR_RESETVALUE        _U(0x00000000); /**< \brief (BSCIF_ISR reset_value) Interrupt Status Register */

#define BSCIF_ISR_OSC32RDY_Pos      0            /**< \brief (BSCIF_ISR) 32kHz Oscillator Ready */
#define BSCIF_ISR_OSC32RDY          (_U(0x1) << BSCIF_ISR_OSC32RDY_Pos)
#define BSCIF_ISR_RC32KRDY_Pos      1            /**< \brief (BSCIF_ISR) 32kHz RC Oscillator Ready */
#define BSCIF_ISR_RC32KRDY          (_U(0x1) << BSCIF_ISR_RC32KRDY_Pos)
#define BSCIF_ISR_RC32KLOCK_Pos     2            /**< \brief (BSCIF_ISR) 32kHz RC Oscillator Lock */
#define BSCIF_ISR_RC32KLOCK         (_U(0x1) << BSCIF_ISR_RC32KLOCK_Pos)
#define BSCIF_ISR_RC32KREFE_Pos     3            /**< \brief (BSCIF_ISR) 32kHz RC Oscillator Reference Error */
#define BSCIF_ISR_RC32KREFE         (_U(0x1) << BSCIF_ISR_RC32KREFE_Pos)
#define BSCIF_ISR_RC32KSAT_Pos      4            /**< \brief (BSCIF_ISR) 32kHz RC Oscillator Saturation */
#define BSCIF_ISR_RC32KSAT          (_U(0x1) << BSCIF_ISR_RC32KSAT_Pos)
#define BSCIF_ISR_BOD33DET_Pos      5            /**< \brief (BSCIF_ISR) BOD33 Detected */
#define BSCIF_ISR_BOD33DET          (_U(0x1) << BSCIF_ISR_BOD33DET_Pos)
#define BSCIF_ISR_BOD18DET_Pos      6            /**< \brief (BSCIF_ISR) BOD18 Detected */
#define BSCIF_ISR_BOD18DET          (_U(0x1) << BSCIF_ISR_BOD18DET_Pos)
#define BSCIF_ISR_BOD33SYNRDY_Pos   7            /**< \brief (BSCIF_ISR) BOD33 Synchronization Ready */
#define BSCIF_ISR_BOD33SYNRDY       (_U(0x1) << BSCIF_ISR_BOD33SYNRDY_Pos)
#define BSCIF_ISR_BOD18SYNRDY_Pos   8            /**< \brief (BSCIF_ISR) BOD18 Synchronization Ready */
#define BSCIF_ISR_BOD18SYNRDY       (_U(0x1) << BSCIF_ISR_BOD18SYNRDY_Pos)
#define BSCIF_ISR_SSWRDY_Pos        9            /**< \brief (BSCIF_ISR) VREG Stop Switching Ready */
#define BSCIF_ISR_SSWRDY            (_U(0x1) << BSCIF_ISR_SSWRDY_Pos)
#define BSCIF_ISR_VREGOK_Pos        10           /**< \brief (BSCIF_ISR) Main VREG OK */
#define BSCIF_ISR_VREGOK            (_U(0x1) << BSCIF_ISR_VREGOK_Pos)
#define BSCIF_ISR_LPBGRDY_Pos       12           /**< \brief (BSCIF_ISR) Low Power Bandgap Voltage Reference Ready */
#define BSCIF_ISR_LPBGRDY           (_U(0x1) << BSCIF_ISR_LPBGRDY_Pos)
#define BSCIF_ISR_AE_Pos            31           /**< \brief (BSCIF_ISR) Access Error */
#define BSCIF_ISR_AE                (_U(0x1) << BSCIF_ISR_AE_Pos)
#define BSCIF_ISR_MASK              _U(0x800017FF) /**< \brief (BSCIF_ISR) MASK Register */

